test/data/test-patient-bloodpressure.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:kron="http://kroniker.service.kihdb.silverbullet.dk/" xmlns:urn="urn:oio:medcom:chronic-dataset:1.0.0" xmlns:ns="http://rep.oio.dk/medcom.dk/xml/schemas/2011/06/20/">
    <soapenv:Header/>
    <soapenv:Body>
        <kron:UploadChronicDataset>
            <!--Optional:-->
            <urn:UploadChronicDatasetRequestMessage>
                <ns:MedComKD>
                    <ns:Borger>
                        <ns:CPR>2512484916</ns:CPR>
                        <ns:Fornavn>Nancy</ns:Fornavn>
                        <ns:Efternavn>Berggren</ns:Efternavn>
                        <ns:FoedselsDato>1948-12-25</ns:FoedselsDato>
                        <ns:Koen>K</ns:Koen>
                        <ns:Vej>Skovvejen 12</ns:Vej>
                        <ns:Postnummer>8010</ns:Postnummer>
                        <ns:By>Aarhus N</ns:By>
                        <ns:Kontakttelefon>86121824</ns:Kontakttelefon>
                        <ns:eMail>nb@meail.dk</ns:eMail>
                    </ns:Borger>
                    <ns:MonitoreringOgMaal>
                        <ns:HjemmeBT>
                            <ns:ID>e6aced22-6de0-11e1-b0c4-0800200c9a66</ns:ID>
                            <ns:Dato>2010-11-28T14:25:00</ns:Dato>
                            <ns:AnalyseID>6543221</ns:AnalyseID>
                            <ns:Systolisk>
                                <ns:IUPAC>MCS88019</ns:IUPAC>
                                <ns:Analyse>Systolisk</ns:Analyse>
                                <ns:Resultat>135</ns:Resultat>
                                <ns:Enhed>mmHG</ns:Enhed>
                                <ns:Max>140</ns:Max>
                                <ns:Abnorm>Normal</ns:Abnorm>
                                <ns:PatientensMaal>140</ns:PatientensMaal>
                            </ns:Systolisk>
                            <ns:Diastolisk>
                                <ns:IUPAC>MCS88020</ns:IUPAC>
                                <ns:Analyse>Diagstolisk</ns:Analyse>
                                <ns:Resultat>100</ns:Resultat>
                                <ns:Enhed>mmHG</ns:Enhed>
                                <ns:Max>90</ns:Max>
                                <ns:Abnorm>Abnorm</ns:Abnorm>
                                <ns:PatientensMaal>90</ns:PatientensMaal>
                            </ns:Diastolisk>
                            <ns:UdfoertAf>OUH, Afd M, Birte Jensen, Sp.</ns:UdfoertAf>
                        </ns:HjemmeBT>
                    </ns:MonitoreringOgMaal>
                </ns:MedComKD>
            </urn:UploadChronicDatasetRequestMessage>
        </kron:UploadChronicDataset>
    </soapenv:Body>
</soapenv:Envelope>